HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_drun41.c
/**
 *******************************************************************************
 * @file  foc_drun41.c
 * @brief FOC mode 41 - current loop with runtime-switchable dq feed-forward.
 *
 * The mode takes only a value copy of the mode 24 calibration snapshot.  At
 * Start it reads the live TMRA_1 count, converts it to the current rotor
 * angle, and integrates all later motion in a private frame.
 *******************************************************************************
 */

#include "foc_drun41.h"
#include "foc_dcal24.h"
#include "foc_math.h"
#include "tmr4_pwm.h"
#include "encoder.h"
#include "motor_config.h"
#include "timer6_timebase.h"
#include "hc32_ll_tmra.h"
#include <math.h>

#define DRUN41_ISR_DT_US  (1000000u / FOC_ISR_HZ)

#define DRUN41_SPEED_WIN_TICKS  ((uint32_t)DRUN41_SPEED_WIN_MS * FOC_ISR_HZ / 1000u)
#define DRUN41_PP_WIN_TICKS     ((uint32_t)DRUN41_PP_WIN_MS * FOC_ISR_HZ / 1000u)
#define DRUN41_MEAN_WIN_TICKS   ((uint32_t)DRUN41_MEAN_WIN_MS * FOC_ISR_HZ / 1000u)
#define DRUN41_ERR_WIN_TICKS    ((uint32_t)DRUN41_ERR_WIN_MS * FOC_ISR_HZ / 1000u)

#define DRUN41_RAD2DEG  57.2958f
#define DRUN41_DEG2RAD  0.0174533f

volatile uint8_t  g_drun41_running       = 0u;
volatile uint8_t  g_drun41_state         = DRUN41_STEP_IDLE;
volatile uint8_t  g_drun41_evt           = 0u;
volatile float    g_drun41_dlt_init_deg  = 90.0f;
volatile float    g_drun41_dlt_targ_deg  = 90.0f;
volatile uint32_t g_drun41_dlt_tr_ms     = 0u;
volatile float    g_drun41_dlt_now_deg   = 0.0f;
volatile float    g_drun41_speed_hz      = 0.0f;
volatile int32_t  g_drun41_field_deg     = 0;
volatile int32_t  g_drun41_rotor_deg     = 0;
volatile int32_t  g_drun41_diff_deg      = 0;
volatile int32_t  g_drun41_rotor_count   = 0;
volatile float    g_drun41_id_ma         = 0.0f;
volatile float    g_drun41_iq_ma         = 0.0f;
volatile float    g_drun41_iq_filt_ma    = 0.0f;
volatile float    g_drun41_iq_filt_alpha = DRUN41_IQ_FILT_ALPHA;
volatile float    g_drun41_id_pp_ma      = 0.0f;
volatile float    g_drun41_iq_pp_ma      = 0.0f;
volatile float    g_drun41_id_mean_ma    = 0.0f;
volatile float    g_drun41_iq_mean_ma    = 0.0f;
volatile float    g_drun41_i_ref_ma      = DRUN41_I_REF_MA;
volatile float    g_drun41_id_ref_ma     = 0.0f;
volatile float    g_drun41_iq_ref_ma     = 0.0f;
volatile float    g_drun41_i_ramp_ma_s   = DRUN41_I_RAMP_MA_S;
volatile uint8_t  g_drun41_vsat          = 0u;
volatile float    g_drun41_ed_mean_ma    = 0.0f;
volatile float    g_drun41_eq_mean_ma    = 0.0f;
volatile float    g_drun41_ed_pp_ma      = 0.0f;
volatile float    g_drun41_eq_pp_ma      = 0.0f;
volatile float    g_drun41_du            = 50.0f;
volatile float    g_drun41_dv            = 50.0f;
volatile float    g_drun41_dw            = 50.0f;
volatile uint8_t  g_drun41_ff_enable     = 0u;
volatile float    g_drun41_ff_bemf_gain  = 1.0f;
volatile float    g_drun41_ff_cross_gain = 1.0f;
volatile float    g_drun41_ff_res_gain   = 1.0f;
volatile float    g_drun41_omega_e_rad_s = 0.0f;
volatile float    g_drun41_vd_pi_v       = 0.0f;
volatile float    g_drun41_vq_pi_v       = 0.0f;
volatile float    g_drun41_vd_ff_v       = 0.0f;
volatile float    g_drun41_vq_ff_v       = 0.0f;
volatile float    g_drun41_vmax_v        = DRUN41_VMAX_DEFAULT_V;
volatile uint32_t g_drun41_time_us       = 0u;
volatile float    g_drun41_step_frac_pct = 90.0f;
volatile uint8_t  g_drun41_id_step_state = DRUN41_STEP_ST_IDLE;
volatile uint8_t  g_drun41_iq_step_state = DRUN41_STEP_ST_IDLE;
volatile float    g_drun41_id_step_target_ma = 0.0f;
volatile float    g_drun41_iq_step_target_ma = 0.0f;
volatile uint32_t g_drun41_id_step_t90_us = DRUN41_STEP_TIME_TIMEOUT;
volatile uint32_t g_drun41_iq_step_t90_us = DRUN41_STEP_TIME_TIMEOUT;

pid_config_t g_drun41_pid_id_cfg = {
    .enabled = true,
    .p_valid = true,
    .i_valid = true,
    .d_valid = false,
    .kp = DRUN41_PI_KP,
    .ki = DRUN41_PI_KI,
    .kd = 0.0f,
    .output_min = -DRUN41_PI_UMAX_V,
    .output_max =  DRUN41_PI_UMAX_V,
    .integral_max = DRUN41_ITERM_MAX_V,
    .i_term_max = DRUN41_ITERM_MAX_V,
    .update_ms = 0,
};

pid_config_t g_drun41_pid_iq_cfg = {
    .enabled = true,
    .p_valid = true,
    .i_valid = true,
    .d_valid = false,
    .kp = DRUN41_PI_KP,
    .ki = DRUN41_PI_KI,
    .kd = 0.0f,
    .output_min = -DRUN41_PI_UMAX_V,
    .output_max =  DRUN41_PI_UMAX_V,
    .integral_max = DRUN41_ITERM_MAX_V,
    .i_term_max = DRUN41_ITERM_MAX_V,
    .update_ms = 0,
};

static pid_state_t s_pid_id;
static pid_state_t s_pid_iq;

static int32_t s_rotor_count;
static uint16_t s_encoder_prev_hw;
static uint8_t s_encoder_initialized;
static float s_zero_u_ma;
static float s_zero_v_ma;
static float s_zero_w_ma;
static uint8_t s_iq_filt_init;

static uint32_t s_run_tick;
static uint8_t s_ramp_done;
static float s_i_ref_ramp;
static uint32_t s_speed_tick;
static int32_t s_speed_acc;

static uint32_t s_pp_tick;
static uint8_t s_pp_init;
static float s_id_min;
static float s_id_max;
static float s_iq_min;
static float s_iq_max;

static uint32_t s_mean_tick;
static int32_t s_id_sum_ma;
static int32_t s_iq_sum_ma;

static uint32_t s_err_tick;
static uint8_t s_err_init;
static int32_t s_ed_sum_ma;
static int32_t s_eq_sum_ma;
static float s_ed_min;
static float s_ed_max;
static float s_eq_min;
static float s_eq_max;

typedef struct {
    uint8_t  state;
    uint8_t  entry_armed;
    float    target_ma;
    float    prev_ref_ma;
    uint32_t start_us;
    uint32_t cross_us;
    uint8_t  cross_tick;
} drun41_step_track_t;

static drun41_step_track_t s_id_step;
static drun41_step_track_t s_iq_step;

static uint16_t s_timer_last_count;
static uint64_t s_time_elapsed_us;
static uint8_t  s_timer_initialized;

static void Drun41_ResetLoopState(void)
{
    s_rotor_count = 0;
    s_encoder_prev_hw = 0u;
    s_encoder_initialized = 0u;
    s_zero_u_ma = 0.0f;
    s_zero_v_ma = 0.0f;
    s_zero_w_ma = 0.0f;
    s_iq_filt_init = 0u;
    s_run_tick = 0u;
    s_ramp_done = 0u;
    s_i_ref_ramp = 0.0f;
    s_speed_tick = 0u;
    s_speed_acc = 0;
    s_pp_tick = 0u;
    s_pp_init = 0u;
    s_id_min = 0.0f;
    s_id_max = 0.0f;
    s_iq_min = 0.0f;
    s_iq_max = 0.0f;
    s_mean_tick = 0u;
    s_id_sum_ma = 0;
    s_iq_sum_ma = 0;
    s_err_tick = 0u;
    s_err_init = 0u;
    s_ed_sum_ma = 0;
    s_eq_sum_ma = 0;
    s_ed_min = 0.0f;
    s_ed_max = 0.0f;
    s_eq_min = 0.0f;
    s_eq_max = 0.0f;
    s_id_step.state = DRUN41_STEP_ST_IDLE;
    s_id_step.entry_armed = 1u;
    s_id_step.target_ma = 0.0f;
    s_id_step.prev_ref_ma = 0.0f;
    s_id_step.start_us = 0u;
    s_id_step.cross_us = 0u;
    s_id_step.cross_tick = 0u;
    s_iq_step = s_id_step;
    s_timer_last_count = 0u;
    s_time_elapsed_us = 0u;
    s_timer_initialized = 0u;
}

