HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_drun41.c
static void Drun41_ClearObservables(void)
{
    g_drun41_evt = 0u;
    g_drun41_dlt_now_deg = g_drun41_dlt_init_deg;
    g_drun41_speed_hz = 0.0f;
    g_drun41_field_deg = 0;
    g_drun41_rotor_deg = 0;
    g_drun41_diff_deg = 0;
    g_drun41_rotor_count = 0;
    g_drun41_id_ma = 0.0f;
    g_drun41_iq_ma = 0.0f;
    g_drun41_iq_filt_ma = 0.0f;
    g_drun41_id_pp_ma = 0.0f;
    g_drun41_iq_pp_ma = 0.0f;
    g_drun41_id_mean_ma = 0.0f;
    g_drun41_iq_mean_ma = 0.0f;
    g_drun41_id_ref_ma = 0.0f;
    g_drun41_iq_ref_ma = 0.0f;
    g_drun41_vsat = 0u;
    g_drun41_ed_mean_ma = 0.0f;
    g_drun41_eq_mean_ma = 0.0f;
    g_drun41_ed_pp_ma = 0.0f;
    g_drun41_eq_pp_ma = 0.0f;
    g_drun41_du = 50.0f;
    g_drun41_dv = 50.0f;
    g_drun41_dw = 50.0f;
    g_drun41_omega_e_rad_s = 0.0f;
    g_drun41_vd_pi_v = 0.0f;
    g_drun41_vq_pi_v = 0.0f;
    g_drun41_vd_ff_v = 0.0f;
    g_drun41_vq_ff_v = 0.0f;
    g_drun41_time_us = 0u;
    g_drun41_step_frac_pct = 75.0f;
    g_drun41_id_step_state = DRUN41_STEP_ST_IDLE;
    g_drun41_iq_step_state = DRUN41_STEP_ST_IDLE;
    g_drun41_id_step_target_ma = 0.0f;
    g_drun41_iq_step_target_ma = 0.0f;
    g_drun41_id_step_t90_us = DRUN41_STEP_TIME_TIMEOUT;
    g_drun41_iq_step_t90_us = DRUN41_STEP_TIME_TIMEOUT;
}

static void Drun41_PpFeed(float id, float iq)
{
    if (s_pp_init == 0u) {
        s_id_min = s_id_max = id;
        s_iq_min = s_iq_max = iq;
        s_pp_init = 1u;
    } else {
        if (id < s_id_min) s_id_min = id;
        if (id > s_id_max) s_id_max = id;
        if (iq < s_iq_min) s_iq_min = iq;
        if (iq > s_iq_max) s_iq_max = iq;
    }

    if (++s_pp_tick >= DRUN41_PP_WIN_TICKS) {
        s_pp_tick = 0u;
        g_drun41_id_pp_ma = (s_id_max - s_id_min) * 1000.0f;
        g_drun41_iq_pp_ma = (s_iq_max - s_iq_min) * 1000.0f;
        s_id_min = s_id_max = id;
        s_iq_min = s_iq_max = iq;
    }
}

static stc_i_data_t Drun41_CorrectedData(const stc_i_data_t *pData)
{
    stc_i_data_t data = *pData;
    data.i16IU_mA = (int16_t)((float)pData->i16IU_mA - s_zero_u_ma);
    data.i16IV_mA = (int16_t)((float)pData->i16IV_mA - s_zero_v_ma);
    data.i16IW_mA = (int16_t)((float)pData->i16IW_mA - s_zero_w_ma);
    return data;
}

static void Drun41_ClearCurrentFeedback(void)
{
    g_drun41_id_ma = 0.0f;
    g_drun41_iq_ma = 0.0f;
    g_drun41_iq_filt_ma = 0.0f;
    g_drun41_id_ref_ma = 0.0f;
    g_drun41_iq_ref_ma = 0.0f;
    g_foc_id_ma = 0.0f;
    g_foc_iq_ma = 0.0f;
}

static uint32_t Drun41_TimeUpdate(void)
{
    uint32_t now_count;
    int32_t timer_delta;
    uint32_t timer_freq;

    now_count = Timer6_Timebase_GetCounter();
    if (s_timer_initialized == 0u) {
        s_timer_last_count = (uint16_t)now_count;
        s_time_elapsed_us = 0u;
        s_timer_initialized = 1u;
        g_drun41_time_us = 0u;
        return 0u;
    }

    timer_delta = (int32_t)(int16_t)((uint16_t)now_count - s_timer_last_count);
    s_timer_last_count = (uint16_t)now_count;
    timer_freq = Timer6_Timebase_GetFrequency();
    if (timer_freq != 0u) {
        s_time_elapsed_us += ((uint64_t)timer_delta * 1000000u
                              + (uint64_t)(timer_freq / 2u)) / (uint64_t)timer_freq;
    }
    g_drun41_time_us = (uint32_t)s_time_elapsed_us;
    return (uint32_t)s_time_elapsed_us;
}

static void Drun41_StepFeed(drun41_step_track_t *track,
                            volatile uint8_t *state_out,
                            volatile float *target_out,
                            volatile uint32_t *time_out,
                            float ref_ma,
                            float actual_ma,
                            uint32_t now_us)
{
    float fraction;
    float threshold_ma;
    uint8_t crossed;

    fraction = g_drun41_step_frac_pct * 0.01f;
    if ((fraction <= 0.0f) || (fraction > 2.0f)) {
        fraction = 0.9f;
    }

    if (track->state == DRUN41_STEP_ST_WAIT) {
        /* The measurement is armed only by the first ISR after entering
         * mode 29. Later Watch changes do not restart this timer. */
        if ((now_us - track->start_us) >= DRUN41_STEP_TIMEOUT_US) {
            track->state = DRUN41_STEP_ST_TIMEOUT;
            *time_out = DRUN41_STEP_TIME_TIMEOUT;
        } else {
            threshold_ma = track->target_ma * fraction;
            if (track->target_ma >= 0.0f) {
                crossed = (actual_ma >= threshold_ma) ? 1u : 0u;
            } else {
                crossed = (actual_ma <= threshold_ma) ? 1u : 0u;
            }

            if (crossed != 0u) {
                if (track->cross_tick == 0u) {
                    track->cross_us = now_us;
                }
                track->cross_tick++;
                if (track->cross_tick >= DRUN41_STEP_CONFIRM_TICK) {
                    track->state = DRUN41_STEP_ST_DONE;
                    *time_out = track->cross_us;
                }
            } else {
                track->cross_tick = 0u;
                track->cross_us = 0u;
            }
        }
    } else if ((track->entry_armed != 0u)
               && ((ref_ma >= DRUN41_STEP_MIN_MA)
                   || (ref_ma <= -DRUN41_STEP_MIN_MA))) {
        track->state = DRUN41_STEP_ST_WAIT;
        track->entry_armed = 0u;
        track->target_ma = ref_ma;
        track->start_us = now_us;
        track->cross_us = 0u;
        track->cross_tick = 0u;
        *time_out = 0u;
        *target_out = ref_ma;
    }

    track->prev_ref_ma = ref_ma;
    *state_out = track->state;
}

void Foc_Drun41_InitPids(void)
{
    PID_Init(&s_pid_id, &g_drun41_pid_id_cfg);
    PID_Init(&s_pid_iq, &g_drun41_pid_iq_cfg);
}

void Foc_Drun41_Start(void)
{
    foc_dcal24_result_t calibration;
    uint16_t hardware_count;
    int32_t encoder_dir;

    if (Foc_Dcal24_GetResult(&calibration) == 0u) {
        g_drun41_running = 0u;
        g_drun41_state = DRUN41_STEP_IDLE;
        DRUN41_LOG("ERROR: no mode 24 calibration; run mode 24 first");
        return;
    }

    Foc_Core_ClearFault();
    Drun41_ResetLoopState();
    Drun41_ClearObservables();
    s_zero_u_ma = calibration.zero_u_ma;
    s_zero_v_ma = calibration.zero_v_ma;
    s_zero_w_ma = calibration.zero_w_ma;
    s_timer_last_count = (uint16_t)Timer6_Timebase_GetCounter();
    s_time_elapsed_us = 0u;
    s_timer_initialized = 1u;
    g_drun41_time_us = 0u;

    hardware_count = TMRA_GetCountValue(CM_TMRA_1);
    encoder_dir = (int32_t)g_foc_enc_dir;
    s_rotor_count = Foc_Core_ModPos((int32_t)hardware_count * encoder_dir - calibration.offset,
                                    (int32_t)ENCODER_CPR);
    s_encoder_prev_hw = hardware_count;
    s_encoder_initialized = 1u;
    g_drun41_rotor_count = s_rotor_count;

