HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_drun41.c
        /* PI outputs are independently clamped.  After adding feed-forward,
         * limit the total dq vector so SVPWM is not asked for an excessive
         * circular voltage. */
        if (g_drun41_vmax_v > 0.0f) {
            float v2 = vd * vd + vq * vq;
            float vmax2 = g_drun41_vmax_v * g_drun41_vmax_v;
            if (v2 > vmax2) {
                float scale = g_drun41_vmax_v / sqrtf(v2);
                vd *= scale;
                vq *= scale;
                g_drun41_vsat = 1u;
            } else {
                g_drun41_vsat = ((vd <= -DRUN41_PI_UMAX_V + 0.01f) ||
                                 (vd >=  DRUN41_PI_UMAX_V - 0.01f) ||
                                 (vq <= -DRUN41_PI_UMAX_V + 0.01f) ||
                                 (vq >=  DRUN41_PI_UMAX_V - 0.01f)) ? 1u : 0u;
            }
        } else {
            g_drun41_vsat = ((vd <= -DRUN41_PI_UMAX_V + 0.01f) ||
                             (vd >=  DRUN41_PI_UMAX_V - 0.01f) ||
                             (vq <= -DRUN41_PI_UMAX_V + 0.01f) ||
                             (vq >=  DRUN41_PI_UMAX_V - 0.01f)) ? 1u : 0u;
        }
    } else {
        g_drun41_vd_ff_v = 0.0f;
        g_drun41_vq_ff_v = 0.0f;
        g_drun41_vsat = ((vd <= -DRUN41_PI_UMAX_V + 0.01f) ||
                         (vd >=  DRUN41_PI_UMAX_V - 0.01f) ||
                         (vq <= -DRUN41_PI_UMAX_V + 0.01f) ||
                         (vq >=  DRUN41_PI_UMAX_V - 0.01f)) ? 1u : 0u;
    }

    g_foc_vd = vd;
    g_foc_vq = vq;

    cos_r = Foc_Math_Cos(rotor_rad);
    sin_r = Foc_Math_Sin(rotor_rad);
    valpha = vd * cos_r - vq * sin_r;
    vbeta  = vd * sin_r + vq * cos_r;
    Foc_Svpwm(valpha, vbeta, FOC_VBUS_V, &du, &dv, &dw);
    TMR4_PWM_SetDuty3Phase(du, dv, dw);

    g_foc_valpha = valpha;
    g_foc_vbeta = vbeta;
    g_foc_theta_rad = rotor_rad;
    g_foc_du = du;
    g_foc_dv = dv;
    g_foc_dw = dw;
    g_drun41_du = du;
    g_drun41_dv = dv;
    g_drun41_dw = dw;

    {
        int32_t error_d = (int32_t)((id_ref - id) * 1000.0f);
        int32_t error_q = (int32_t)((iq_ref - iq) * 1000.0f);

        if (s_err_init == 0u) {
            s_ed_min = s_ed_max = (float)error_d;
            s_eq_min = s_eq_max = (float)error_q;
            s_err_init = 1u;
        } else {
            if (error_d < s_ed_min) s_ed_min = (float)error_d;
            if (error_d > s_ed_max) s_ed_max = (float)error_d;
            if (error_q < s_eq_min) s_eq_min = (float)error_q;
            if (error_q > s_eq_max) s_eq_max = (float)error_q;
        }
        s_ed_sum_ma += error_d;
        s_eq_sum_ma += error_q;
        if (++s_err_tick >= DRUN41_ERR_WIN_TICKS) {
            s_err_tick = 0u;
            g_drun41_ed_mean_ma = (float)s_ed_sum_ma / (float)DRUN41_ERR_WIN_TICKS;
            g_drun41_eq_mean_ma = (float)s_eq_sum_ma / (float)DRUN41_ERR_WIN_TICKS;
            g_drun41_ed_pp_ma = s_ed_max - s_ed_min;
            g_drun41_eq_pp_ma = s_eq_max - s_eq_min;
            s_ed_sum_ma = 0;
            s_eq_sum_ma = 0;
            s_ed_min = s_ed_max = (float)error_d;
            s_eq_min = s_eq_max = (float)error_q;
        }
    }

    s_speed_acc += corrected_delta;
    if (++s_speed_tick >= DRUN41_SPEED_WIN_TICKS) {
        g_drun41_speed_hz = (float)s_speed_acc * (float)FOC_POLE_PAIRS
                          * (1000.0f / (float)DRUN41_SPEED_WIN_MS)
                          / (float)ENCODER_CPR;
        s_speed_tick = 0u;
        s_speed_acc = 0;
    }

    field_deg = (int32_t)((rotor_rad + delta_rad) * DRUN41_RAD2DEG);
    if (field_deg >= 360) field_deg -= 360;
    rotor_deg = (int32_t)(rotor_rad * DRUN41_RAD2DEG);
    angle_diff = field_deg - rotor_deg;
    angle_diff = 180 - Foc_Core_ModPos(180 - angle_diff, 360);
    g_drun41_field_deg = field_deg;
    g_drun41_rotor_deg = rotor_deg;
    g_drun41_diff_deg = angle_diff;
}
